app/views/employees/index.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL ORDER BY "profiles"."id" ASC LIMIT ?  [["employee_id", 3], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL  [["employee_id", 1]]
---
        <tr class="employee">
          <% if employee.profiles.active.present? %>
            <% if employee == current_user %>
              <td><%= link_to format("%06d", employee.number), edit_employee_profile_path(employee, employee.profiles.active.first) %></td>
            <% else %>
              <td><%= link_to format("%06d", employee.number), employee_profile_path(employee, employee.profiles.active.first) %></td>