app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "content", "auther", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @article = Article.find(params[:id])
    ActiveRecord::Base.transaction do
      now = Time.now
      @article.update_column(:deleted_at, now)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "deleted_at" = ? WHERE "articles"."id" = ?  [["deleted_at", "2022-12-04 02:15:51.570760"], ["id", 2]]