app/controllers/employees_controller.rb

  def index
    @employees = Employee.active.order("#{sort_column} #{sort_direction}").page(params[:page]).per(20)
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL ORDER BY department_id desc

  def create
    @employee = Employee.new(employee_params)

    # add_params

    if @employee.save
---
INSERT INTO "employees" ("department_id", "office_id", "number", "last_name", "first_name", "account", "password", "email", "date_of_joining", "employee_info_manage_auth", "created_at", "updated_at", "news_posting_auth") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_employee
    @employee = Employee.find(params["id"])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_form_option
    @departments = Department.all
    @offices = Office.all
---
SELECT "departments".* FROM "departments"
SELECT "offices".* FROM "offices"